Repository: jamshidhusenov/quiz_careator
Catalog: lib/l10n/app_*.arb
Languages: uz

# loginTitle
source: Welcome!
uz: Xush kelibsiz!

# loginSubtitle
source: Enter your details to log in
uz: Tizimga kirish uchun ma'lumotlarni kiriting

# loginButton
source: Login
uz: Kirish

# passwordField
source: Password
uz: Parol

# addQuestion
source: Add New Question
uz: Yangi savol qo'shish

# solveQuiz
source: Take a Quiz
uz: Test ishlash

source: View Questions
uz: Savollarni ko'rish

# quizConfig
source: Quiz Settings
uz: Test sozlamalari

# questionCount
source: Number of Questions
uz: Savollar soni

source: Shuffle Options
uz: Variantlarni aralashtirish

source: Start Quiz
uz: Testni boshlash

# questionsFound
source: {count} questions found
uz: {count} ta savol topildi

# noQuestions
source: No questions found
uz: Savollar topilmadi

source: Correct
uz: To'g'ri

source: Incorrect
uz: Noto'g'ri

source: Score
uz: Natija

source: Back to Home
uz: Bosh sahifaga qaytish

source: Save
uz: Saqlash

source: Clear All
uz: Tozalash

source: Questions List
uz: Savollar ro'yxati

source: Explanation
uz: Tushuntirish

source: Copied!
uz: Nusxalandi!

source: Copy Template
uz: Nusxa olish

# templateFormat
source: Enter questions and answers in the following format:
uz: Savol va javoblarni quyidagi formatda kiriting:

# pasteHint
source: Paste text here...
uz: Shu yerga textni paste qiling...

source: Question
uz: Savol

# noExplanation
source: No explanation available for this question.
uz: Bu savol bo'yicha hozircha tushuntirish mavjud emas.

source: OK
uz: Tushunarli

source: Questions
uz: savol

# successMessage
source: Well done!
uz: Barakalla!

# failureMessage
source: Try again!
uz: Yana harakat qiling!

source: Retry Quiz
uz: Test ishlashda davom etish

source: All Questions
uz: Barcha savollar

source: From
uz: Dan

source: To
uz: Gacha

# questionGrid
source: Question Navigator
uz: Savollar tartibi

# rangeSelection
source: Select Range
uz: Oraliqni tanlash

source: Random Questions
uz: Random savollar

source: Finish Test
uz: Testni tugatish
